init.org
#+title: My Emacs Configuration
#+date: 2025年12月15日 19:50:50
#+author: Jousimies

全新安装时，[[id:20251215T193404.084688][macim]] [[id:20251215T193430.701678][emt]] 以及 [[id:20251215T193604.179263][macos]] 需要生成 dylib 文件，否则会卡住 Emacs 启动。

* Early Init
存放底层优化：GC初始设置、UI预设、性能检测。
#+begin_src emacs-lisp :tangle ~/.emacs.d/early-init.el
  ;;; early-init.el --- Early Init File -*- lexical-binding: t; no-byte-compile: t -*-
#+end_src

#+begin_src emacs-lisp :tangle ~/.emacs.d/early-init.el
  ;; Profiling since here when in debug-mode
  (when init-file-debug
    (profiler-start 'cpu)
    (add-hook 'window-setup-hook #'profiler-stop 0))
#+end_src

#+begin_src emacs-lisp :tangle ~/.emacs.d/early-init.el
  ;; Defer garbage collection further back in the startup process
  (setq gc-cons-threshold most-positive-fixnum
        gc-cons-percentage 1.0)
  (setq package-enable-at-startup nil)
#+end_src

#+begin_src emacs-lisp :tangle ~/.emacs.d/early-init.el
  ;; Emacs startup performance
  ;; https://github.com/seagle0128/.emacs.d/blob/master/init.el
  (setq auto-mode-case-fold nil)

  (unless (or (daemonp) noninteractive init-file-debug)
    ;; Suppress file handlers operations at startup
    ;; `file-name-handler-alist' is consulted on each call to `require' and `load'
    (let ((old-value file-name-handler-alist))
      (setq file-name-handler-alist nil)
      (set-default-toplevel-value 'file-name-handler-alist file-name-handler-alist)
      (add-hook 'emacs-startup-hook
                (lambda ()
                  "Recover file name handlers."
                  (setq file-name-handler-alist
                        (delete-dups (append file-name-handler-alist old-value))))
                101)))
#+end_src

#+begin_src emacs-lisp :tangle ~/.emacs.d/early-init.el
  ;; https://www.emacswiki.org/emacs/ExecPath
  (defun set-exec-path-from-shell-PATH ()
    "This is particularly useful under Mac OS X and macOS."
    (interactive)
    (let ((path-from-shell (replace-regexp-in-string
                            "[ \t\n]*$" "" (shell-command-to-string
                                            "$SHELL --login -c 'echo $PATH'"))))
      (setenv "PATH" path-from-shell)
      (setq exec-path (split-string path-from-shell path-separator))))

  (when (eq system-type 'darwin)
    (set-exec-path-from-shell-PATH))
#+end_src

#+begin_src emacs-lisp :tangle ~/.emacs.d/early-init.el
  ;; Prevent the glimpse of un-styled Emacs by disabling these UI elements early.
  (setq-default inhibit-redisplay t
                inhibit-message t)
  (add-hook 'window-setup-hook
            (lambda ()
              (setq-default inhibit-redisplay nil
                            inhibit-message nil)
              (redisplay)))
#+end_src

#+begin_src emacs-lisp :tangle ~/.emacs.d/early-init.el
  (push '(menu-bar-lines . 0) default-frame-alist)
  (push '(tool-bar-lines . 0) default-frame-alist)
  (push '(scroll-bar-width . 5) default-frame-alist)
  (push '(undecorated . t) default-frame-alist)
  (push '(width . 100) default-frame-alist)
  (push '(vertical-scroll-bars . nil) default-frame-alist)
  (push '(left-fringe . 0) default-frame-alist)
  (push '(right-fringe . 0) default-frame-alist)
#+end_src

#+begin_src emacs-lisp :tangle ~/.emacs.d/early-init.el
  ;; Use fullscreen or maximized
  (setopt is-fullscreen nil)		;maximized

  (if is-fullscreen
      (push '(fullscreen . fullscreen) initial-frame-alist)
    (push '(fullscreen . maximized) initial-frame-alist))

  ;; Themes
  (when is-fullscreen
    (setq ns-use-native-fullscreen nil))
#+end_src

#+begin_src emacs-lisp :tangle ~/.emacs.d/early-init.el
  (setq-default mode-line-format nil)
  (setq byte-compile-warnings nil)

  (blink-cursor-mode -1)

  (fset 'display-startup-echo-area-message 'ignore)
#+end_src

* Initialization
#+begin_src emacs-lisp :tangle ~/.emacs.d/init.el
  ;;; init.el --- Emacs Initial Configuration          -*- lexical-binding: t; -*-
#+end_src

** COMMENT Packages
需要运行一次 ~package-quickstart-refresh~
#+begin_src emacs-lisp :tangle ~/.emacs.d/init.el
  (setq package-archives '(("gnu" . "https://elpa.gnu.org/packages/")
  			 ("nongnu" . "https://elpa.nongnu.org/nongnu/")
  			 ("melpa" . "https://melpa.org/packages/")))
  ;; (setopt package-quickstart t)
  (package-initialize)
#+end_src

** COMMENT benchmark
#+begin_src emacs-lisp :tangle ~/.emacs.d/init.el
  (use-package benchmark-init
    :load-path "~/.emacs.d/packages/"
    :config
    (add-hook 'after-init-hook 'benchmark-init/deactivate))
#+end_src

** Dependency
#+begin_src emacs-lisp :tangle ~/.emacs.d/init.el
  (add-to-list 'load-path "~/.emacs.d/packages/dash.el/")
  (add-to-list 'load-path "~/.emacs.d/packages/f.el/")
  (add-to-list 'load-path "~/.emacs.d/packages/s.el/")
#+end_src

** Better garbage collection
#+begin_src emacs-lisp :tangle ~/.emacs.d/init.el
  (add-hook 'emacs-startup-hook
            (lambda ()
              (setq gc-cons-threshold (* 100 1024 1024)
                    gc-cons-percentage 0.1)))
#+end_src

#+begin_src emacs-lisp :tangle ~/.emacs.d/init.el
  (use-package gcmh
    :load-path "~/.emacs.d/packages/gcmh/"
    :hook (after-init . gcmh-mode)
    :custom
    (gc-cons-percentage 0.1)
    (gcmh-verbose nil)
    (gcmh-idle-delay 'auto)
    (gcmh-auto-idle-delay-factor 10)
    (gcmh-high-cons-threshold #x1000000))

  (advice-add 'after-focus-change-function :after 'garbage-collect)
#+end_src
** System Coding
#+begin_src emacs-lisp :tangle ~/.emacs.d/init.el
  (set-language-environment "UTF-8")	;中文
  (prefer-coding-system 'utf-8)
  (set-default-coding-systems 'utf-8)
  (set-terminal-coding-system 'utf-8)
  (set-keyboard-coding-system 'utf-8)
#+end_src
** Custom & Self Defined Variables
*** Variables defined in C source code
#+begin_src emacs-lisp :tangle ~/.emacs.d/init.el
  (setopt ring-bell-function (lambda ()
  			     (invert-face 'mode-line)
  			     (run-with-timer 0.05 nil 'invert-face 'mode-line))) ;关闭 ring bell,用 mode-line 替代
  (setopt use-short-answers t)		;用 y/n 替代 yes/no
  (setopt create-lockfiles nil)		;不要创建 lockfiles
  (setopt history-delete-duplicates t)	;删除历史记录重复项
  (setopt delete-by-moving-to-trash t)	;删除文件至系统垃圾箱
  (setopt cursor-in-non-selected-windows nil) ;除当前窗口不显示光标
  (setopt read-buffer-completion-ignore-case t)
  (setopt ns-use-proxy-icon nil)
  (setopt ns-use-srgb-colorspace nil)
#+end_src

#+begin_src emacs-lisp :tangle ~/.emacs.d/init.el
  (setopt enable-recursive-minibuffers t)
  (setopt read-minibuffer-restore-windows nil
    	minibuffer-prompt-properties '(read-only t cursor-intangible t face minibuffer-prompt))
#+end_src

*** Platform
#+begin_src emacs-lisp :tangle ~/.emacs.d/init.el
  (defconst IS-MAC     (eq system-type 'darwin))
  (defconst IS-LINUX   (eq system-type 'gnu/linux))
  (defconst IS-WINDOWS (memq system-type '(cygwin windows-nt ms-dos)))
#+end_src

*** Directories
#+begin_src emacs-lisp :tangle ~/.emacs.d/init.el
  (defvar nextcloud "~/Nextcloud"
    "This folder is My cloud.")

  (defvar icloud "~/Library/Mobile Documents/"
    "This folder contains documents in icloud.")

  (defvar my-galaxy (expand-file-name "L.Personal.Galaxy" nextcloud)
    "This folder stores all the plain text files of my life.")

  (defvar website-directory (expand-file-name "blogs_source/" my-galaxy)
    "The source folder of my blog.")

  (defvar my-pictures (expand-file-name "pictures/" my-galaxy)
      "The folder save pictures.")

  (defvar my-web_archive (expand-file-name "web_archive/" my-galaxy)
      "The folder save web pages.")

  (defvar cache-directory (expand-file-name ".cache" user-emacs-directory))
#+end_src

** Display and Appearance

*** dashboard
#+begin_src emacs-lisp :tangle ~/.emacs.d/init.el
  (use-package dashboard
    :load-path "~/.emacs.d/packages/emacs-dashboard/"
    :demand t
    :hook (dashboard-mode . (lambda ()
  			    (setq-local display-line-numbers nil)))
    :bind (:map dashboard-mode-map
  			  ("n" . dashboard-next-line)
  			  ("p" . dashboard-previous-line))
    :custom
    (dashboard-startup-banner (expand-file-name "src/bitmap.png" user-emacs-directory))
    (dashboard-image-banner-max-width 500)
    (dashboard-icon-type 'nerd-icons)
    (dashboard-set-file-icons t)
    (dashboard-center-content t)
    (dashboard-set-init-info t)
    (dashboard-week-agenda nil)
    (dashboard-set-footer nil)
    (dashboard-items '((recents  . 5)
                       (bookmarks . 5)
                       (registers . 5)))
    (dashboard-banner-logo-title "EXPLORE THE WORLD, FULFILL YOUR BEING.")
    :config
    (dashboard-setup-startup-hook))
#+end_src

*** display line numbers mode
#+begin_src emacs-lisp :tangle ~/.emacs.d/init.el
  (add-hook 'prog-mode-hook #'display-line-numbers-mode)
  (add-hook 'org-mode-hook #'display-line-numbers-mode)
  (with-eval-after-load 'display-line-numbers
    (setopt display-line-numbers-widen t
  	  display-line-numbers-type 'relative))
#+end_src
*** display fill column indicator mode
#+begin_src emacs-lisp :tangle ~/.emacs.d/init.el
  (add-hook 'prog-mode-hook #'display-fill-column-indicator-mode)
  (with-eval-after-load 'display-fill-column-indicator
    (face-spec-set 'fill-column-indicator
  		 '((default :height 0.1))
  		 'face-override-spec)
    (setq-default fill-column 90))
#+end_src

*** visual line mode
#+begin_src emacs-lisp :tangle ~/.emacs.d/init.el
  (add-hook 'org-mode-hook #'visual-line-mode)
  (add-hook 'eww-mode #'visual-line-mode)
#+end_src
*** highlight line mode
#+begin_src emacs-lisp :tangle ~/.emacs.d/init.el
  (when (display-graphic-p)
    (add-hook 'prog-mode-hook #'hl-line-mode)
    (add-hook 'package-menu-mode #'hl-line-mode))

  (with-eval-after-load 'hl-line
    (setopt hl-line-sticky-flag nil))
#+end_src

*** auto switch theme
#+begin_src emacs-lisp :tangle ~/.emacs.d/init.el
  (when (featurep 'ns)
    (defun my/apply-theme (appearance)
      "Load theme, taking current system APPEARANCE into consideration."
      (mapc #'disable-theme custom-enabled-themes)
      (pcase appearance
        ('light (load-theme 'modus-operandi-deuteranopia t))
        ('dark (load-theme 'modus-vivendi-deuteranopia t))))
    (add-hook 'ns-system-appearance-change-functions #'my/apply-theme))
#+end_src

*** COMMENT alpha background
#+begin_src emacs-lisp :tangle ~/.emacs.d/init.el
;; Adjust alpha background
(defun lucius/adjust-opacity (frame incr)
  "Adjust the background opacity of FRAME by increment INCR."
  (unless (display-graphic-p frame)
    (error "Cannot adjust opacity of this frame"))
  (let* ((oldalpha (or (frame-parameter frame 'alpha-background) 100))
         ;; The 'alpha frame param became a pair at some point in
         ;; emacs 24.x, e.g. (100 100)
         (oldalpha (if (listp oldalpha) (car oldalpha) oldalpha))
         (newalpha (+ incr oldalpha)))
    (when (and (<= frame-alpha-lower-limit newalpha) (>= 100 newalpha))
      (modify-frame-parameters frame (list (cons 'alpha-background newalpha))))))

(defun my/increase-alpha-background ()
  (interactive)
  (lucius/adjust-opacity (selected-frame) 5))
(global-set-key (kbd "s-<f2>") #'my/increase-alpha-background)

(defun my/decrease-alpha-background ()
  (interactive)
  (lucius/adjust-opacity (selected-frame) -5))
(global-set-key (kbd "s-<f1>") #'my/decrease-alpha-background)
#+end_src

*** Font setting
~set-face-attribute~ 设置默认字体， ~set-fontset-font~ 用于指定某些字符集使用特定的字体。
#+begin_src emacs-lisp :tangle ~/.emacs.d/init.el
  ;; 设置中文字集
  ;; `han': 汉字字符集，主要用于简体中文和繁体中文字符
  ;; `cjk-misc': CJK（中日韩）字符集中的其他字符，包含了少量的中文、日文、韩文字符
  ;; `kana': 日文假名字符集，但在处理与中文相关的文档时可能偶尔用到
  ;; `bopomofo': 注音符号字符集，用于台湾地区的汉字注音

  (setopt use-default-font-for-symbols nil)

  (when IS-MAC
    (set-face-attribute 'default nil :family "Cascadia Next SC" :height 140))

  (when (and IS-MAC (display-graphic-p))
    (dolist (charset '(kana han cjk-misc bopomofo symbol))
      (set-fontset-font (frame-parameter nil 'font) charset
                        (font-spec :family "SimSun"))))

  (when IS-WINDOWS
    (dolist (charset '(kana han cjk-misc bopomofo symbol))
      (set-fontset-font (frame-parameter nil 'font) charset
                        (font-spec :family "SimHei"))))

  (when (display-graphic-p)
    (set-fontset-font t 'unicode (font-spec :family "Symbols Nerd Font Mono" :size 14) nil 'prepend))

  (when (display-graphic-p)
    (set-fontset-font t 'emoji (font-spec :family "Apple Color Emoji" :size 14) nil 'prepend)
    (set-fontset-font t 'symbol (font-spec :family "Symbols" :size 14) nil 'prepend))
#+end_src
